app/controllers/incidents_controller.rb

SELECT "incidents".* FROM "incidents"
---
  def index
    @incidents = Incident.all

INSERT INTO "incidents" ("priority", "dept_id", "person_id", "subject", "location_of_incident", "time_of_incident", "additional_details", "progress", "public", "picture_url", "video_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @incident = Incident.new(incident_params)
    respond_to do |format|
      if @incident.save

SELECT  "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT 1  [["id", 980190962]]
---
  def update
    incident = Incident.find_by_id(params[:id])

SELECT  "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "incidents" WHERE "incidents"."id" = $1  [["id", 1]]
---
  def destroy
    incident = Incident.find_by_id(params[:id])
    if incident != nil
      @incident = incident
      incident.destroy

SELECT  "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT 1  [["id", 5]]
---
    def set_incident
      @incident = Incident.find(params[:id])